# Taps
tap 'aybabtme/tap'
tap 'd12frosted/emacs-plus'
tap 'esolitos/ipa'
tap 'goreleaser/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'koekeishiya/formulae'
tap 'warrensbox/tap'

# CLI
brew 'awscli'
brew 'bash'
brew 'clang-format'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'docker-compose'
brew 'editorconfig'
brew 'emacs-plus'
brew 'esolitos/ipa/sshpass'
brew 'etcd'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gettext'
brew 'git'
brew 'git-crypt'
brew 'gnu-sed'
brew 'gnupg'
brew 'go'
brew 'goreleaser'
brew 'gpg'
brew 'graphviz'
brew 'groovy'
brew 'gzip'
brew 'helm'
brew 'htop'
brew 'jq'
brew 'jump'
brew 'kubernetes-cli'
brew 'llvm'
brew 'minikube'
brew 'mysql'
brew 'node'
brew 'openjdk@11'
brew 'openssl'
brew 'packer'
brew 'pandoc'
brew 'pinentry-mac'
brew 'pkg-config'
brew 'pngpaste'
brew 'protobuf'
brew 'pyenv'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rustup'
brew 'shellcheck'
brew 'shfmt'
brew 'skhd'
brew 'st'
brew 'telnet'
brew 'tfswitch'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'yabai'
brew 'yq'
brew 'z'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# GUI
cask 'alacritty'
cask 'alfred'
cask 'bettertouchtool'
cask 'docker'
cask 'dotnet-sdk'
cask 'firefox'
cask 'font-menlo-for-powerline'
cask 'google-chrome'
cask 'iterm2'
cask 'macs-fan-control'
cask 'mactex'
cask 'marked'
cask 'microsoft-teams'
cask 'obs'
cask 'powershell'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
