# Taps
tap "aybabtme/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "puppetlabs/puppet"
tap "warrensbox/tap"

# CLI
brew "ansible"
brew "aria2"
brew "awscli"
brew "aybabtme/tap/dorepl"
brew "aybabtme/tap/humanlog"
brew "bash"
brew "bazaar"
brew "cfssl"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "curl"
brew "dep"
brew "detox"
brew "direnv"
brew "doctl"
brew "etcd"
brew "exiftool"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gettext"
brew "git"
brew "git-crypt"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "graphviz"
brew "gzip"
brew "helm"
brew "htop"
brew "hub"
brew "hugo"
brew "jhead"
brew "jq"
brew "jump"
brew "kubernetes-cli"
brew "kustomize"
brew "mercurial"
brew "minikube"
brew "mysql"
brew "node"
brew "packer"
brew "pkg-config"
brew "protobuf"
brew "rbenv"
brew "rclone"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "salt"
brew "shellcheck"
brew "st"
brew "telnet"
brew "terraform"
brew "tfswitch"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "unrar"
brew "vault"
brew "vim"
brew "wget"
brew "youtube-dl"
brew "yq"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# GUI
cask "alfred"
cask "bettertouchtool"
cask "chef-workstation"
cask "docker"
cask "iterm2"
cask "obs"
cask "pdk"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
