# Taps
tap 'aybabtme/tap'
tap 'goreleaser/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'puppetlabs/puppet'
tap 'warrensbox/tap'

# CLI
brew 'aria2'
brew 'awscli'
brew 'aybabtme/tap/dorepl'
brew 'aybabtme/tap/humanlog'
brew 'bash'
brew 'cfssl'
brew 'colordiff'
brew 'coreutils'
brew 'curl'
brew 'dep'
brew 'detox'
brew 'direnv'
brew 'docker-compose'
brew 'doctl'
brew 'etcd'
brew 'exiftool'
brew 'ffmpeg'
brew 'fzf'
brew 'gettext'
brew 'git'
brew 'git-crypt'
brew 'gnu-sed'
brew 'gnupg'
brew 'go'
brew 'goreleaser'
brew 'graphviz'
brew 'gzip'
brew 'helm'
brew 'htop'
brew 'hub'
brew 'hugo'
brew 'jhead'
brew 'jq'
brew 'jump'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'minikube'
brew 'mysql'
brew 'node'
brew 'openssl'
brew 'packer'
brew 'pkg-config'
brew 'pre-commit'
brew 'protobuf'
brew 'rbenv'
brew 'rclone'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rust'
brew 'salt'
brew 'shellcheck'
brew 'sphinx'
brew 'sphinx-doc'
brew 'st'
brew 'telnet'
brew 'tfswitch'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vault'
brew 'vim'
brew 'wget'
brew 'yq'
brew 'z'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# GUI
cask 'alfred'
cask 'bettertouchtool'
cask 'docker'
cask 'dotnet-sdk'
cask 'font-menlo-for-powerline'
cask 'google-chrome'
cask 'iterm2'
cask 'microsoft-teams'
cask 'obs'
cask 'pdk'
cask 'powershell'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio'
cask 'visual-studio-code'
cask 'vlc'
